read_verilog -sv nerv.sv
synth -top nerv
write_verilog nerv_synth.v
