[gold]
read_verilog -sv ../../examples/nerv/nerv.sv
prep -top nerv
memory_map

[gate]
read_verilog -sv ../../examples/nerv/nerv_change.sv
prep -top nerv

[collect *]
#group regfile*
join imm_*
join insn*

[strategy simple]
use sat
depth 10
