[options]

[gold]
read_verilog counter.sv
prep -top counter
exec -- sleep 10

[gate]
read_verilog counter.sv
synth -top counter

[strategy simple]
use sby
xprop on
depth 10
depth 10
