[options]

[gold]
read_verilog counter.sv
prep -top counter
exec -- sleep 10

[gate]
read_verilog counter.sv
synth -top counter

[strategy simple]
use sby
engine smtbmc bitwuzla
engine smtbmc bitwuzla
xprop on
