[options]
splitnets on

[gold]
read_verilog counter.sv
prep -top counter

[gate]
read_verilog counter.sv
synth -top counter

[script]
stat

[strategy simple]
use satseq
depth 10
