[options]
syntax_error 1

[gold]
read_verilog counter.sv
prep -top counter
exec -- sleep 10

[gate]
read_verilog counter.sv
synth -top counter

[strategy simple]
use satseq
depth 10
