logger -expect error "Wire 'i1' not found in gate." 1

read_verilog << EOF
module top(input i, output o);
assign o = i;
endmodule
EOF
uniquify
hierarchy
design -stash gold

read_verilog << EOF
module top(input i, output o);
assign o = i;
endmodule
EOF
uniquify
hierarchy

eqy_recode -recode data/gate_wire_missing.ids
