logger -expect error "Mapping gate value '00' not proper width." 1

read_verilog << EOF
module top(input i, output o);
assign o = i;
endmodule
EOF
uniquify
hierarchy
design -stash gold

read_verilog << EOF
module top(input i, output o);
assign o = i;
endmodule
EOF
uniquify
hierarchy

eqy_recode -recode data/gate_value_width_error.ids
