[options]
splitnets on

[gold]
read_verilog -formal picorv32.v
prep -top picorv32

[gate]
logger -nowarn limited.support.for.tri-state.*/cells_sim.v
read_verilog -nowb -noblackbox +/xilinx/cells_sim.v
read_verilog -formal picorv32_vivado.v
prep -top picorv32

[match *]
gate-nomatch /^mem_(wstrb|wdata|addr)_reg\[\d+\].Q$/
gate-match /^(.*)_reg\[(\d+)\].Q$/ \1[\2]
nodefault

[collect *]
solo mem_wdata[0]

[strategy simple]
use satseq
depth 10

[strategy dummy]
use dummy
